Revit 2026 API

# ConnectorAssignedDuctFlowConfiguration Property

---

The assigned duct flow configuration of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DuctFlowConfigurationType AssignedDuctFlowConfiguration { get; }
```
```vb
Public ReadOnly Property AssignedDuctFlowConfiguration As DuctFlowConfigurationType
	Get
```
```cpp
public:
property DuctFlowConfigurationType AssignedDuctFlowConfiguration {
	DuctFlowConfigurationType get ();
}
```
```fsharp
member AssignedDuctFlowConfiguration : DuctFlowConfigurationType with get
```

#### Property Value

DuctFlowConfigurationType

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the connector's domain is not DomainHvac. Thrown when the connector is not in a family instance. |
| InvalidOperationException | Thrown on failure to get duct flow configuration. |

Assigned duct flow configuration may be assigned for connectors of some family instances.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace